---
kind: type
id: T:Autodesk.Revit.DB.DataExchangeMessageSeverity
source: html/58faa4d4-5f07-500e-e6e4-477c4449a0cd.htm
---
# Autodesk.Revit.DB.DataExchangeMessageSeverity

Error levels for DataExchangeLog

## Syntax (C#)
```csharp
public enum DataExchangeMessageSeverity
```